import sys
import os
import time
import subprocess
import qrcode
def clear():
    os.system("clear")
def quish_banner():
    print("""
░██████╗░██╗░░░██╗██╗░██████╗██╗░░██╗  ███╗░░░███╗███████╗███╗░░██╗██╗░░░██╗
██╔═══██╗██║░░░██║██║██╔════╝██║░░██║  ████╗░████║██╔════╝████╗░██║██║░░░██║
██║██╗██║██║░░░██║██║╚█████╗░███████║  ██╔████╔██║█████╗░░██╔██╗██║██║░░░██║
╚██████╔╝██║░░░██║██║░╚═══██╗██╔══██║  ██║╚██╔╝██║██╔══╝░░██║╚████║██║░░░██║
░╚═██╔═╝░╚██████╔╝██║██████╔╝██║░░██║  ██║░╚═╝░██║███████╗██║░╚███║╚██████╔╝
░░░╚═╝░░░░╚═════╝░╚═╝╚═════╝░╚═╝░░╚═╝  ╚═╝░░░░░╚═╝╚══════╝╚═╝░░╚══╝░╚═════╝░""")
    
def quish_menu():
    print("""
╔═══════════════════════════════════════╗
║ 1. QR link generator                  ║
║ 2. Social Engineering Toolkit         ║
║ 3.                                    ║
║ 4.                                    ║
║ 5.                                    ║
║                                       ║
║                                       ║
║                                       ║
║ 99. Exit                              ║
╚═══════════════════════════════════════╝ """)

clear()
quish_banner()
while True:
    quish = input("Enter your choice>> ")
    if quish == ("1"):
        subprocess.run(("pip", "install", "qrcode"))
        link = input("Enter the link to generate QR code: ")

        qr = qrcode.QRCode(
        version=1,
        error_correction=qrcode.constants.ERROR_CORRECT_Q,
        box_size=10,
        border=4,
        )

        qr.add_data(link)
        qr.make(fit=True)

        img = qr.make_image(fill_color="black", back_color="white")
        img.save("qrcode.png")

        print("QR code saved as qrcode.png")
    
    elif quish in ("clear", "cls"):
        clear()
    elif quish in ("2", "3", "4", "5"):
        print("Coming soon... 😳")
    elif quish in ("99", "exit"):
        sys.exit()
    
    else:
        print("Option not available")